apache/nuttx/arch/xtensa/src/esp32s2/esp32s2_serial.c
static void esp32s2_shutdown(struct uart_dev_s *dev)
{
  struct esp32s2_uart_s *priv = dev->priv;

  /* Disable ints */

  esp32s2_lowputc_disable_all_uart_int(priv, NULL);

  /* Disable clk */

  esp32s2_lowputc_disable_sysclk(priv);

  /* Disable memory clock */

  esp32s2_lowputc_disable_memclk(priv);
}

/****************************************************************************
 * Name: esp32s2_attach
 *
 * Description:
 *   Configure the UART to operate in interrupt driven mode.  This method
 *   is called when the serial port is opened.  Normally, this is just after
 *   the setup() method is called, however, the serial console may
 *   operate in a non-interrupt driven mode during the boot phase.
 *
 *   RX and TX interrupts are not enabled by the attach method (unless
 *   the hardware supports multiple levels of interrupt enabling). The RX
 *   and TX interrupts are not enabled until the txint() and rxint() methods
 *   are called.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *
 * Returned Values:
 *   Zero (OK) is returned on success; A negated errno value is returned
 *   to indicate the nature of any failure.
 *
 ****************************************************************************/

static int esp32s2_attach(struct uart_dev_s *dev)
{
  struct esp32s2_uart_s *priv = dev->priv;

  DEBUGASSERT(priv->cpuint == -ENOMEM);

  /* Set up to receive peripheral interrupts on the current CPU */

  priv->cpuint = esp_setup_irq(priv->periph, priv->int_pri,
                               ESP_IRQ_TRIGGER_LEVEL, uart_handler, dev);
  if (priv->cpuint < 0)
    {
      /* Failed to allocate a CPU interrupt of this type */

      return priv->cpuint;
    }

  /* Enable the CPU interrupt (RX and TX interrupts are still disabled
   * in the UART)
   */

  up_enable_irq(priv->irq);

  return OK;
}

/****************************************************************************
 * Name: esp32s2_detach
 *
 * Description:
 *   Detach UART interrupts.  This method is called when the serial port is
 *   closed normally just before the shutdown method is called.  The
 *   exception is the serial console which is never shutdown.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *
 ****************************************************************************/

static void esp32s2_detach(struct uart_dev_s *dev)
{
  struct esp32s2_uart_s *priv = dev->priv;

  DEBUGASSERT(priv->cpuint != -ENOMEM);

  /* Disable the CPU interrupt */

  up_disable_irq(priv->irq);

  /* Disassociate the peripheral interrupt from the CPU interrupt.
   * This also clears the handler from the HAL's interrupt table.
   */

  esp_teardown_irq(priv->periph, priv->cpuint);
  priv->cpuint = -ENOMEM;
}

/****************************************************************************
 * Name: esp32s2_txint
 *
 * Description:
 *    Enable or disable TX interrupts.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *   enable     -  If true enables the TX interrupt, if false disables it.
 *
 ****************************************************************************/

static void esp32s2_txint(struct uart_dev_s *dev, bool enable)
{
  struct esp32s2_uart_s *priv = dev->priv;
  uint32_t ints_mask = UART_TXFIFO_EMPTY_INT_ENA_M | UART_TX_DONE_INT_ENA_M;

  if (enable)
    {
      /* After all bytes physically transmitted in the RS485 bus
       * the TX_BRK_IDLE will indicate we can disable the TX pin.
       */

#ifdef HAVE_RS485
      if (priv->rs485_dir_gpio != 0)
        {
          modifyreg32(UART_INT_ENA_REG(priv->id),
                      0, UART_TX_BRK_IDLE_DONE_INT_ENA);
        }
#endif

      /* Set to receive an interrupt when the TX holding FIFO is empty or
       * a transmission is done.
       */

#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      modifyreg32(UART_INT_ENA_REG(priv->id), 0, ints_mask);
#endif
    }
  else
    {
      /* Disable the TX interrupts */

      modifyreg32(UART_INT_ENA_REG(priv->id), ints_mask, 0);
    }
}

/****************************************************************************
 * Name: esp32s2_rxint
 *
 * Description:
 *   Enable or disable RX interrupts.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *   enable     -  If true enables the RX interrupt, if false disables it.
 *
 ****************************************************************************/

static void esp32s2_rxint(struct uart_dev_s *dev, bool enable)
{
  struct esp32s2_uart_s *priv = dev->priv;
  uint32_t ints_mask = UART_RXFIFO_TOUT_INT_ENA_M |
                       UART_RXFIFO_FULL_INT_ENA_M;

  if (enable)
    {
      /* Receive an interrupt when there is anything in the RX FIFO
       * (or when a RX timeout occurs).
       * NOTE: RX timeout feature needs to be enabled.
       */
#ifndef CONFIG_SUPPRESS_SERIAL_INTS
      modifyreg32(UART_CONF1_REG(priv->id), 0, UART_RX_TOUT_EN_M);
      modifyreg32(UART_INT_ENA_REG(priv->id), ints_mask, ints_mask);
#endif
    }
  else
    {
      modifyreg32(UART_CONF1_REG(priv->id), UART_RX_TOUT_EN_M, 0);

      /* Disable the RX interrupts */

      modifyreg32(UART_INT_ENA_REG(priv->id), ints_mask, 0);
    }
}

/****************************************************************************
 * Name: esp32s2_rxavailable
 *
 * Description:
 *   Check if there is any data available to be read.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *
 * Returned Values:
 *   Return true if the RX FIFO is not empty and false if RX FIFO is empty.
 *
 ****************************************************************************/

static bool esp32s2_rxavailable(struct uart_dev_s *dev)
{
  struct esp32s2_uart_s *priv = dev->priv;
  uint32_t status_reg;
  uint32_t bytes;

  status_reg = getreg32(UART_STATUS_REG(priv->id));

  bytes =  REG_MASK(status_reg, UART_RXFIFO_CNT);

  return (bytes > 0) ? true : false;
}

/****************************************************************************
 * Name: esp32s2_txready
 *
 * Description:
 *    Check if the transmit hardware is ready to send another byte.
 *    This is used to determine if send() method can be called.
 *
 * Parameters:
 *   dev        -  Pointer to the serial driver struct.
 *
 * Returned Values:
 *   Return true if the transmit hardware is ready to send another byte,
 *   false otherwise.
 *
 ****************************************************************************/

